{"id":3711,"date":"2014-06-30T21:50:33","date_gmt":"2014-06-30T21:50:33","guid":{"rendered":"http:\/\/mycmsloans.wpengine.com\/?page_id=14"},"modified":"2014-06-30T21:50:33","modified_gmt":"2014-06-30T21:50:33","slug":"faq","status":"publish","type":"page","link":"https:\/\/mycmsloans.com\/learn\/faq\/","title":{"rendered":"FAQ"},"content":{"rendered":"<div class=\"flex_column av_one_full  flex_column_div first  avia-builder-el-0  avia-builder-el-no-sibling  \" ><div  class=\"togglecontainer   toggle_close_all  avia-builder-el-1  avia-builder-el-no-sibling \" >\n<section class=\"av_toggle_section\"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\"  >    <div class=\"single_toggle\" data-tags=\"{All} \"  >        <p data-fake-id=\"#toggle-id-1\" class=\"toggler \"  itemprop=\"headline\"    role=\"tab\" tabindex=\"0\" aria-controls=\"toggle-id-1\">Q: What documents do I need to submit along with my loan application?<span class=\"toggle_icon\" >        <span class=\"vert_icon\"><\/span><span class=\"hor_icon\"><\/span><\/span><\/p>        <div id=\"toggle-id-1-container\" class=\"toggle_wrap \"  >            <div class=\"toggle_content invers-color \"  itemprop=\"text\"   ><p>At a minimum, CMS needs the following in order to process your loan application:<\/p>\n<p>2 years of tax returns<br \/>\n1 month of paystubs<br \/>\n2 months of bank statements<br \/>\n2 months of all retirement statements (401K, IRA, stocks, bonds, etc.)<br \/>\nCopy of driver&#8217;s license<br \/>\nCopy of Social Security card<\/p>\n<p>Please see our full <a href=\"\/tools\/loan-app-checklist\/\">Loan Application Checklist<\/a> for a complete list of the documents that we will need from you.<\/p>\n            <\/div>        <\/div>    <\/div><\/section>\n<section class=\"av_toggle_section\"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\"  >    <div class=\"single_toggle\" data-tags=\"{All} \"  >        <p data-fake-id=\"#toggle-id-2\" class=\"toggler \"  itemprop=\"headline\"    role=\"tab\" tabindex=\"0\" aria-controls=\"toggle-id-2\">Q: What is a credit score?<span class=\"toggle_icon\" >        <span class=\"vert_icon\"><\/span><span class=\"hor_icon\"><\/span><\/span><\/p>        <div id=\"toggle-id-2-container\" class=\"toggle_wrap \"  >            <div class=\"toggle_content invers-color \"  itemprop=\"text\"   ><p>Before deciding on what terms lenders will offer you on a loan (which they base on the &#8220;risk&#8221; to them), they want to know two things about you: your ability to pay back the loan, and your willingness to pay back the loan. For the first, they look at your income-to-debt obligation ratio. For your willingness to pay back the loan, they consult your credit score.<\/p>\n<p>The most widely used credit scores are FICO scores, which were developed by Fair Isaac &amp; Company, Inc. (and they&#8217;re named after their inventor!). Your FICO score is between 350 (high risk) and 850 (low risk).<\/p>\n<p>Credit scores only consider the information contained in your credit profile. They do not consider your income, savings, down payment amount, or demographic factors like gender, race, nationality or marital status. In fact, the fact they don&#8217;t consider demographic factors is why they were invented in the first place. &#8220;Profiling&#8221; was as dirty a word when FICO scores were invented as it is now. Credit scoring was developed as a way to consider only what was relevant to somebody&#8217;s willingness to repay a loan.<\/p>\n<p>Past delinquencies, derogatory payment behavior, current debt level, length of credit history, types of credit and number of inquiries are all considered in credit scores. Your score considers both positive and negative information in your credit report. Late payments will lower your score, but establishing or reestablishing a good track record of making payments on time will raise your score.<\/p>\n<p>Different portions of your credit history are given different weights. Thirty-five percent of your FICO score is based on your specific payment history. Thirty percent is your current level of indebtedness. Fifteen percent each is the time your open credit has been in use (ten year old accounts are good, six month old ones aren&#8217;t as good) and types of credit available to you (installment loans such as student loans, car loans, etc. versus revolving and debit accounts like credit cards). Finally, five percent is pursuit of new credit &#8212; credit scores requested.<\/p>\n<p>Your credit report must contain at least one account which has been open for six months or more, and at least one account that has been updated in the past six months for you to get a credit score. This ensures that there is enough information in your report to generate an accurate score. If you do not meet the minimum criteria for getting a score, you may need to establish a credit history prior to applying for a mortgage.<\/p>\n            <\/div>        <\/div>    <\/div><\/section>\n<section class=\"av_toggle_section\"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\"  >    <div class=\"single_toggle\" data-tags=\"{All} \"  >        <p data-fake-id=\"#toggle-id-3\" class=\"toggler \"  itemprop=\"headline\"    role=\"tab\" tabindex=\"0\" aria-controls=\"toggle-id-3\">Q: Can I use my 401K for down payment?<span class=\"toggle_icon\" >        <span class=\"vert_icon\"><\/span><span class=\"hor_icon\"><\/span><\/span><\/p>        <div id=\"toggle-id-3-container\" class=\"toggle_wrap \"  >            <div class=\"toggle_content invers-color \"  itemprop=\"text\"   ><p>You&#8217;ve finally found the home of your dreams. There&#8217;s just one thing standing between you and your new house: The down payment.<\/p>\n<p>Many home buyers today opt to use funds from their employer’s 401(K) program to come up with the down payment on a house.<\/p>\n<p>Ordinarily, you can&#8217;t take money from your 401(K) plan unless you retire, leave the company or become disabled, but many company plans permit certain “hardship withdrawals” when there is an immediate and heavy financial need, including the purchase of the employee&#8217;s principal residence.<\/p>\n<p>The drawback to a hardship withdrawal is that you will pay taxes and penalties on the amount withdrawn from your plan, which often must be paid in the year of withdrawal. And while hardship withdrawals are allowed by law, your employer is not required to provide them in your plan.<\/p>\n<p>Check with your employer’s human resources department if you&#8217;re not sure if your 401(K) plan allows hardship withdrawal.<\/p>\n<p>Another approach may be to borrow against your 401(K) – often as much as 50 percent of your account balance. You pay interest on the loan, but the interest goes back into your account. The money you receive is not taxable as long it is paid back and plans can give you anywhere from five to 30 years to pay back your loan.<\/p>\n<p>There are risks involved in borrowing from your 401(K). If you lose your job or leave your employer, you must pay back the loan in full within a short period, sometimes as little as 60 days. If the money is not paid back in that time, it is considered a withdrawal from your plan and subjected to the same taxes and penalties. And while 401(K) accounts can usually be rolled over into a new employer’s 401(K) without penalties, loans from a 401(K) cannot be rolled over.<\/p>\n<p>In addition, because the funds withdrawn from your account are no longer earning compound interest, your account will be smaller when you retire. And you’ll be replacing pretax money with after-tax money.<\/p>\n<p>Some lenders will count the money you borrowed from your 401(K) as an additional debt that will go along with your car payments, student loans and credit cards. While it may seem unfair since you are borrowing your own money, most lenders view it as a payment obligation that affects your debt-to-income ratio in qualifying for a home loan. It may be a factor in whether you decide to make a hardship withdrawal from your 401(K) and pay tax penalties or borrow against it.<\/p>\n            <\/div>        <\/div>    <\/div><\/section>\n<section class=\"av_toggle_section\"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\"  >    <div class=\"single_toggle\" data-tags=\"{All} \"  >        <p data-fake-id=\"#toggle-id-4\" class=\"toggler \"  itemprop=\"headline\"    role=\"tab\" tabindex=\"0\" aria-controls=\"toggle-id-4\">Q: What is a \"rate lock period\"? How can I make sure my rate is low?<span class=\"toggle_icon\" >        <span class=\"vert_icon\"><\/span><span class=\"hor_icon\"><\/span><\/span><\/p>        <div id=\"toggle-id-4-container\" class=\"toggle_wrap \"  >            <div class=\"toggle_content invers-color \"  itemprop=\"text\"   ><p>A rate lock or a rate commitment is a lender&#8217;s promise to hold a certain interest rate and a certain number of points for you for a specified period of time while your application is processed. This prevents you from going through your whole application process and at the end of it finding out the interest rate has gone up.<\/p>\n<p>A rate lock period can vary in length, and longer ones usually cost more. A lender will agree to &#8220;hold&#8221; your interest rate and points for a longer period, say 60 days, but in exchange the rate and maybe points are higher than with a shorter rate lock period, for example.<\/p>\n<p>There are many ways besides opting for a shorter rate lock period to get a lower rate, though. A larger down payment will result in a lower interest rate than a smaller one, because you&#8217;re starting out with more equity. You can pay points to lower your rate over the life of the loan, but that means you pay more up front. For many people, this makes sense and is a good deal.<\/p>\n<p>Closing costs are fees paid by the lender, which the lender in turn charges you to close the loan. Many people pay closing costs when they sign on the dotted line, but a person can also finance their closing costs. Paying closing costs when the loan closes will reduce your interest rate.<\/p>\n<p>Finally, the interest rate a lender is willing to offer you depends on your credit score and your debt-to-income ratio. If you have good credit and your income far exceeds your debt obligations, you will qualify for a lower rate.<\/p>\n            <\/div>        <\/div>    <\/div><\/section>\n<\/div><\/div>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":3708,"menu_order":3,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/3711"}],"collection":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/comments?post=3711"}],"version-history":[{"count":0,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/3711\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/3708"}],"wp:attachment":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/media?parent=3711"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}