{"id":110,"date":"2014-07-24T20:29:15","date_gmt":"2014-07-24T20:29:15","guid":{"rendered":"http:\/\/mycmsloans.wpengine.com\/?page_id=110"},"modified":"2014-07-24T20:29:15","modified_gmt":"2014-07-24T20:29:15","slug":"reverse-mortgage-myths","status":"publish","type":"page","link":"https:\/\/mycmsloans.com\/learn\/loans\/reverse-mortgages\/reverse-mortgage-myths\/","title":{"rendered":"Reverse Mortgage Loans Myths"},"content":{"rendered":"<div class=\"flex_column av_one_full  flex_column_div first  avia-builder-el-0  el_before_av_textblock  avia-builder-el-first  \" ><section class=\"av_textblock_section \"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\" ><div class='avia_textblock  '   itemprop=\"text\" ><p><strong>A Reverse Mortgage Loan sells the home to the bank<\/strong><br \/>\nLenders are not in the business of owning homes &#8211; they wish to make loans and earn interest. The homeowner keeps the title to the home in their name. What the lender does is add a lien onto the title for the amount that is borrowed so that the lender can guarantee that it will eventually get paid back the money it lends.<\/p>\n<p><strong>Heirs will not inherit the home<\/strong><br \/>\nThe estate inherits the home as usual but there will be a lien on the title for the balance of the Reverse Mortgage. The balance is whatever proceeds were received from the Reverse Mortgage plus interest.<\/p>\n<p>For example, let&#8217;s assume someone takes out a reverse mortgage and owes $50,000 after 5 years. Then the homeowner passes away and the estate sells the house for $250,000. The lender gets $50,000 and the estate inherits $200,000.<\/p>\n<p>A Reverse Mortgage Loan is a &#8220;non-recourse&#8221; loan which means the only asset guaranteeing the loan is the property itself. If the property value is less than the balance of the reverse mortgage, the lender can not request other assets from the estate and must make an insurance claim for the loss to the FHA.<\/p>\n<p><strong>The homeowner could get forced out of the home<\/strong><br \/>\nThe FHA Reverse Mortgage Loan was created specifically to allow seniors to live in their home for the rest of their lives. Because the homeowner receives payments from a reverse mortgage instead of making payments to a lender, the homeowner can never be evicted or foreclosed on for non-payment. However, it is the homeowner&#8217;s responsibility to maintain the home in good condition, keep property insurance current, and pay the property taxes.<\/p>\n<p><strong>Social Security and Medicare will be affected<\/strong><br \/>\nGovernment entitlement programs such as Social Security and Medicare are not affected by a Reverse Mortgage Loan. However, need-based programs such as Medicaid can be affected. To remain eligible for Medicaid, the homeowner needs to manage how much is withdrawn from the reverse mortgage in one month to ensure they do not exceed the Medicaid limits.<\/p>\n<p><strong>The homeowner pays taxes on a Reverse Mortgage Loan<\/strong><br \/>\nThe proceeds from a Reverse Mortgage Loan are not considered income and are not taxable. Furthermore, the interest on reverse mortgage is tax deductible when it is repaid.<\/p>\n<p><strong>There are large out-of-pocket expenses<\/strong><br \/>\nTypically the only out-of-pocket expenses are the cost of the counseling and the appraisal. If requested, many lenders will agree to pay the appraisal fee upfront and finance the cost into the loan.<\/p>\n<p><strong>A Reverse Mortgage Loan is similar to a home equity loan<\/strong><br \/>\nThe only similarity between a Reverse Mortgage and a home equity loan is that both use the home&#8217;s equity as collateral.<\/p>\n<ul>\n<li>Any homeowner can apply for a home equity loan. A homeowner must be age 62 to apply for a reverse mortgage loan.<\/li>\n<li>A home equity loan must be repaid in monthly payments over 5 or 10 years. A reverse mortgage is not paid back until the homeowner moves out of the property or passes away.<\/li>\n<\/ul>\n<\/div><\/section><\/div><section class=\"av_textblock_section \"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\" ><div class='avia_textblock  '  style='font-size:10px; '  itemprop=\"text\" ><p>*These materials are not from HUD or FHA and were not approved by HUD or a government agency*<\/p>\n<\/div><\/section><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":21,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/110"}],"collection":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/comments?post=110"}],"version-history":[{"count":0,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/110\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/21"}],"wp:attachment":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/media?parent=110"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}