{"id":18,"date":"2014-06-30T21:51:43","date_gmt":"2014-06-30T21:51:43","guid":{"rendered":"http:\/\/mycmsloans.wpengine.com\/?page_id=18"},"modified":"2014-06-30T21:51:43","modified_gmt":"2014-06-30T21:51:43","slug":"va-loans","status":"publish","type":"page","link":"https:\/\/mycmsloans.com\/learn\/loans\/va-loans\/","title":{"rendered":"VA Loans"},"content":{"rendered":"<div class=\"flex_column av_one_full  flex_column_div first  avia-builder-el-0  avia-builder-el-no-sibling  \" ><section class=\"av_textblock_section \"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\" ><div class='avia_textblock  '   itemprop=\"text\" ><h3 style=\"text-align: center; line-height: 170%;\"><span style=\"color: #808080;\">A VA loan is a United States mortgage loan and is guaranteed by the U.S. Department of Veterans Affairs (VA) for eligible veterans or their surviving spouses (providing they do not remarry).<\/span><\/h3>\n<\/div><\/section><br \/>\n<div   class='hr hr-default   avia-builder-el-2  el_after_av_textblock  el_before_av_textblock '><span class='hr-inner ' ><span class='hr-inner-style'><\/span><\/span><\/div><br \/>\n<section class=\"av_textblock_section \"  itemscope=\"itemscope\" itemtype=\"https:\/\/schema.org\/CreativeWork\" ><div class='avia_textblock  '   itemprop=\"text\" ><p>The VA direct home loan assists eligible veterans in areas where private financing may not be available. It also allows veterans to purchase their home without a down payment. There are areas designated by the VA as housing credit shortage areas. These are rural areas and small cities and towns away from metropolitan or commuting areas of large cities.<\/p>\n<p>102.15 percent financing is available to eligible veterans without private mortgage insurance. 20 per cent second mortgages can also be obtained offering an added $6,000 for energy efficient improvements. The VA charges 0 to 3.15% of the loan amount and may be included in the financing. When purchasing, a veteran can borrow as much as 102.15% of the sales prices or assessed value of the home, whichever is less. For a refinance, veterans can borrow up to 90% of the assessed value, this can vary in different states.<\/p>\n<p>With a VA loan a veteran can qualify for larger loan amounts than a traditional Fannie Mae\/ conforming loan. VA insures mortgages where the monthly payment of the home can be up to 41% of the gross monthly income. Conforming loans will only allow 28%.<br \/>\nMaximum VA loan guarantees vary by county. $417,000 is the maximum VA loan amount with no down payment as of January 1, 2010. Download the county list to view the maximum VA loan guaranty amount in your county.<\/p>\n<p>VA will also allow the seller to pay all the closing cost as long as they do not exceed 6% of the sales price of the home.<\/p>\n<h4>Funding Fees<\/h4>\n<p>VA requires a funding fee to be paid unless the veteran is exempt or receives a VA disability compensation. This fee can be paid in full or included in the loan. Fees which may not be included in a VA loan are credit report, appraisal, loan processing fee, title search, title insurance, recording fees, transfer taxes, survey charges and hazard insurance. It is allowable that the seller pay these fees if negotiated for them to do so. Any surviving spouse of a military veteran who has died in service or has a service related disability is exempt from such a fee.<\/p>\n<p>The VA funding fee can be financed into the maximum loan amount so long as the funding fee and sales price do not exceed the maximum loan amount in your county. This additional difference would be an out of pocket expense from either the seller or the buyer. Impound accounts for property taxes and homeowners insurance are required on all VA loans. The calculation for this monthly payment is called a PITI payment.<\/p>\n<h4>VA Loan Application<\/h4>\n<p>The VA loan application is a standardized loan application form 1003 issued by Fannie Mae also known as Freddie Mac Form 65. It is a Federal crime punishable by fine or imprisonment, or both, to knowingly make any false statements on a VA loan application under the provisions of Title 18, United States Code, Section 1001, “VA Home Loan Application”. Fannie Mae.<\/p>\n<\/div><\/section><\/p><\/div>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":3709,"menu_order":5,"comment_status":"open","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/18"}],"collection":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/comments?post=18"}],"version-history":[{"count":0,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/18\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/pages\/3709"}],"wp:attachment":[{"href":"https:\/\/mycmsloans.com\/wp-json\/wp\/v2\/media?parent=18"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}